function K = kfun_rbf(U, V, gamma)
% rbf 核函数，径向基函数，K(i,j)=exp(-γ*||i-j||^2)

[m1 n1] = size(U);
[m2 n2] = size(V);
% *************************************************************************
% n1 == n2，m1 ~= m2
% 要计算m1个向量和m2个向量两两之间的核函数值，总共m1*m2个数值结果，K(i,j)就表示
% U(i,:)与V(j,:)在高维映射空间中的点积
% *************************************************************************
K = zeros(m1, m2);

for i = 1:m1
    for j = 1:m2
        K(i, j) = exp( -gamma * norm(U(i, :)-V(j, :))^2 );
    end
end
